# Applying Functions

In [1]:
import pandas as pd
df=pd.read_csv("Practice/raw_data.csv")
df1=df.copy()
df1["tax"]=df1["income"].apply(lambda x:"20%" if x>50000 else "10%")
df1

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  20%
1    1      John Doe  29.0     USA     Male  55000.0  20%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  20%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  20%

In [2]:
df1["gender"]=df1["gender"].map({"Male":'M',"Female":'F'})
df1

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA    NaN  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%

In [5]:
df2=df1.assign(new_income=df["income"]*1.5)
df2

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0     USA      M  55000.0  20%     82500.0
1    1      John Doe  29.0     USA      M  55000.0  20%     82500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     93000.0
3    3          Alex   NaN     USA    NaN  47000.0  10%     70500.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%     76500.0
6    6           NaN  45.0   India      F  73000.0  20%    109500.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%    102000.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%     93000.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     67500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%     87000.0

In [11]:
df2["country"]=df2["country"].replace({"USA":"us","Canada":"cd","Spain":"sp","China":"ch","India":"in","Mexico":"mx"})
df2.fillna(0)

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0      us      M  55000.0  20%     82500.0
1    1      John Doe  29.0      us      M  55000.0  20%     82500.0
2    2    Jane Smith   0.0      cd      F  62000.0  20%     93000.0
3    3          Alex   0.0      us      0  47000.0  10%     70500.0
4    4  Maria Garcia  34.0      sp      F      0.0  10%         0.0
5    5        Li Wei  27.0      ch      M  51000.0  20%     76500.0
6    6             0  45.0      in      F  73000.0  20%    109500.0
7    7    Ahmed Khan  38.0       0      M  68000.0  20%    102000.0
8    8    Rachel Lee  29.0      us      F  62000.0  20%     93000.0
9    9   Carlos Ruiz   0.0      mx      M  45000.0  10%     67500.0
10  10   Emily Davis  31.0      us      0  58000.0  20%     87000.0

In [13]:
df3=df2.rename( columns={"new_income":"after_appraisel"})
df3

    id          name   age country gender   income  tax  after_appraisel
0    1      John Doe  29.0      us      M  55000.0  20%          82500.0
1    1      John Doe  29.0      us      M  55000.0  20%          82500.0
2    2    Jane Smith   NaN      cd      F  62000.0  20%          93000.0
3    3          Alex   NaN      us    NaN  47000.0  10%          70500.0
4    4  Maria Garcia  34.0      sp      F      NaN  10%              NaN
5    5        Li Wei  27.0      ch      M  51000.0  20%          76500.0
6    6           NaN  45.0      in      F  73000.0  20%         109500.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%         102000.0
8    8    Rachel Lee  29.0      us      F  62000.0  20%          93000.0
9    9   Carlos Ruiz   NaN      mx      M  45000.0  10%          67500.0
10  10   Emily Davis  31.0      us    NaN  58000.0  20%          87000.0